"""
Постой консольный калькулятор.
"""
while True:
    print()
    print('*' * 15, ' калькулятор ', '*' * 15)
    print('*' * 4, 'Для выхода из программы введите "q"', '*' * 4)
    print()
    a = input('Введите математическое действие "+", "-", "*", "/" ')
    if a == 'q':
        break
    elif a in ('+', '-', '*', '/'):
        b = float(input('Введите первое число '))
        c = float(input('Введите второе число '))
        if a == '+':
            print('%0.2f' % (b + c))
        elif a == '-':
            print('%0.2f' % (b - c))
        elif a == '*':
            print('%0.2f' % (b * c))
        elif a == '/':
            if c == 0:
                print('Делить на ноль нельзя!')
            else:
                print('%0.2f' % (b / c))
    else:
        print('Вы ввели не верное математическое действие ')
